src/test/resources/api/v1/invoices/invc_v9YicJdb67siaXue.json

{
  "id": "invc_v9YicJdb67siaXue",
  "object": "invoice",
  "gross_amount": 180,
  "tax_amount": 12,
  "amount": 192,
  "billing_method": "recurring",
  "customer_id": "cust_2WmsQoSRZMWWkcZg",
  "currency": "INR",
  "created_at": 1539171807,
  "description": "",
  "due_date": 1539171804,
  "line_items": {
    "total_count": 1,
    "object": "list",
    "data": [
      {
        "id": "item_I9Gh0wJHJ2tvorbT",
        "object": "invoiceitem",
        "name": "Item1",
        "description": "",
        "amount": 500,
        "currency": "INR",
        "customer_id": "cust_VD9uYO8uc29b4hY8",
        "quantity": 1,
        "created_at": 1539179491,
        "notes": null,
        "deleted_at": 0,
        "unit": "",
        "hsn_code": "hsn_code",
        "sac_code": "",
        "taxrate": 500,
        "cess": 200,
        "tax_inclusive": false,
        "discount": 20,
        "tax_amount": 12,
        "net_amount": 192,
        "taxable_amount": 180,
        "gross_amount": 180
      }
    ]
  },
  "notes": null,
  "notify_by": "email",
  "payment_attempt": 0,
  "invoice_no": "INV_90976164",
  "status": "issued",
  "subscription_id": "sub_xLH108FJwUlX47SI",
  "url": "https://payabbhi.com/zta7qvp8",
  "place_of_supply": "Delhi",
  "terms_conditions": "terms_conditions",
  "customer_notes": "customer_notes",
  "customer_notification_by":"platform"
}